Revit 2026 API

# DuctIsDuctTypeId Method

---

Checks if given type is valid duct type.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsDuctTypeId(
	Document document,
	ElementId ductTypeId
)
```
```vb
Public Shared Function IsDuctTypeId (
	document As Document,
	ductTypeId As ElementId
) As Boolean
```
```cpp
public:
static bool IsDuctTypeId(
	Document^ document,
	ElementId^ ductTypeId
)
```
```fsharp
static member IsDuctTypeId :
        document : Document *
        ductTypeId : ElementId -> bool
```

#### Parameters

document Document
     The document.
ductTypeId ElementId
     ElementId of the duct type to check.

#### Return Value

Boolean True if duct type can used for this duct, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A type is valid for duct if it can be used to the duct element.

#### Reference

Duct Class

Autodesk.Revit.DB.Mechanical Namespace